import sqlite3

def insert_pokemon_data():
    db_path = 'pokemon_database.db'
    conn = sqlite3.connect(db_path)
    cursor = conn.cursor()

    # ポケモンデータの挿入
    pokemon_data = [
        (1, 'ヒトカゲ', 1, 1, 1, 1, 1, 1, 1, 1, 1),
        (2, 'リザード', 1, 2, 2, 2, 2, 2, 2, 2, 2),
        (3, 'リザードン', 7, 3, 3, 3, 3, 3, 3, 3, 3),
        (4, 'フシギダネ', 2, 4, 4, 4, 4, 4, 4, 4, 4),
        (5, 'フシギソウ', 2, 5, 5, 5, 5, 5, 5, 5, 5),
        (6, 'フシギバナ', 2, 6, 6, 6, 6, 6, 6, 6, 6),
        (7, 'ゼニガメ', 3, 7, 7, 7, 7, 7, 7, 7, 7),
        (8, 'カメール', 3, 8, 8, 8, 8, 8, 8, 8, 8),
        (9, 'カメックス', 3, 9, 9, 9, 9, 9, 9, 9, 9),
        (10, 'コイル', 4, 10, 10, 10, 10, 10, 10, 10, 10),
        (11, 'レアコイル', 4, 11, 11, 11, 11, 11, 11, 11, 11),
        (12, 'ディグダ', 5, 12, 12, 12, 12, 12, 12, 12, 12),
        (13, 'ダグトリオ', 5, 13, 13, 13, 13, 13, 13, 13, 13),
        (14, 'ツボツボ', 6, 14, 14, 14, 14, 14, 14, 14, 14)
    ]

    cursor.executemany("""
    INSERT INTO 種族テーブル (
        種族ID, 種族名, タイプ組み合わせID, HPステータスID, こうげきステータスID, ぼうぎょステータスID, 
        とくこうステータスID, とくぼうステータスID, すばやさステータスID, 特性ID, 付与努力値ID
    ) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
    """, pokemon_data)

    # 変更をコミット
    conn.commit()
    # 接続のクローズ
    conn.close()

    print("ポケモンデータが挿入されました。")

# データ挿入関数の呼び出し
insert_pokemon_data()